#pragma once

#include "MiscDefinitions.h"
#include "ClientRecvProps.h"
#include "offsets.h"
#include "Vector.h"

#include "Backtrack.h"
#pragma warning( disable : 3646)
#pragma warning( disable : 2059)
#pragma warning( disable : 2334)
#define TEAM_CS_T 2
#define TEAM_CS_CT 3

#define BONE_USED_BY_HITBOX			0x00000100

#define ptr( x, x1, x2 ) *(x*)( (DWORD)x1 + (DWORD)x2 )

class IClientRenderable;
class IClientNetworkable;
class IClientUnknown;
class IClientThinkable;
class IClientEntity;
class CSWeaponInfo;

class CSWeaponInfo
{
public:
	void* pVTable;
	char* pWeaponnamefordropinconsolepName; //0x0008 
	__int32 _pad0[3];
	__int32 iMaxClip1; //0x0014 
	__int32 iMaxClip2; //0x0018 
	__int32 iDefaultClip1; //0x001C 
	__int32 iDefaultClip2; //0x0020 
	char _0x0024[8];
	char* pWorldModel; //0x002C 
	char* pViewModel; //0x0030 
	char* pDroppedWorldModel; //0x0034 
	char _0x0038[80];
	char* pAnimationPrefix; //0x0088 
	char* pPrintName2; //0x008C 
	char _0x0090[56];
	__int32 iWeaponType; //0x00C8 
	__int32 iWeaponPrice; //0x00CC 
	__int32 iKillAward; //0x00D0 
	char* pPrintname; //0x00D4 
	char _0x00D8[16];
	BYTE bFullAuto; //0x00E8 
	char _0x00E9[3];
	__int32 m_iDamage; //0x00EC 
	float m_flArmorRatio; //0x00F0 
	char _0x00F4[4];
	float m_flPenetration; //0x00F8 
	char _0x00FC[8];
	float m_flRange; //0x0104 
	float m_flRangeModifier; //0x0108 
	char _0x010C[28];
	__int32 iTeamNum; //0x0128 
	float flMaxSpeed; //0x012C 
	float flMaxSpeed2; //0x0130 
	char _0x0134[136];
	__int32 iZoomLevels; //0x01BC 
	__int32 iZoomFOV[2]; //0x01C0 
	float flZoomTime[3]; //0x01C8 
	char _0x01D4[52];
	char* pZoomInSound; //0x0208 
	char* pZoomOutSound; //0x020C 
	char _0x0210[24];
	BYTE bHasBurstmode; //0x0228 
	BYTE bIsRevolver; //0x0229 
	char _0x022A[22];
};//Size=0x240

enum class CSGOClassID
{
	CAK47 = 1,
	CBaseAnimating = 2,
	CBaseAnimatingOverlay = 3,
	CBaseAttributableItem = 4,
	CBaseButton = 5,
	CBaseCombatCharacter = 6,
	CBaseCombatWeapon = 7,
	CBaseCSGrenade = 8,
	CBaseCSGrenadeProjectile = 9,
	CBaseDoor = 10,
	CBaseEntity = 11,
	CBaseFlex = 12,
	CBaseGrenade = 13,
	CBaseParticleEntity = 14,
	CBasePlayer = 15,
	CBasePropDoor = 16,
	CBaseTeamObjectiveResource = 17,
	CBaseTempEntity = 18,
	CBaseToggle = 19,
	CBaseTrigger = 20,
	CBaseViewModel = 21,
	CBaseVPhysicsTrigger = 22,
	CBaseWeaponWorldModel = 23,
	CBeam = 24,
	CBeamSpotlight = 25,
	CBoneFollower = 26,
	CBreakableProp = 27,
	CBreakableSurface = 28,
	CC4 = 29,
	CCascadeLight = 30,
	CChicken = 31,
	CColorCorrection = 32,
	CColorCorrectionVolume = 33,
	CCSGameRulesProxy = 34,
	CCSPlayer = 35,
	CCSPlayerResource = 36,
	CCSRagdoll = 37,
	CCSTeam = 38,
	CDEagle = 39,
